{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": 0.3,
  "directionality": "bidi",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-PERSON",
    "2": "I-PERSON",
    "3": "B-ORGANIZATION",
    "4": "I-ORGANIZATION",
    "5": "B-LOCATION",
    "6": "I-LOCATION",
    "7": "B-DATE",
    "8": "I-DATE",
    "9": "B-OCCUPATION",
    "10": "I-OCCUPATION"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-DATE": 7,
    "B-LOCATION": 5,
    "B-OCCUPATION": 9,
    "B-ORGANIZATION": 3,
    "B-PERSON": 1,
    "I-DATE": 8,
    "I-LOCATION": 6,
    "I-OCCUPATION": 10,
    "I-ORGANIZATION": 4,
    "I-PERSON": 2,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.52.4",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 105879
}
